; domain
(define (domain liftedtcore_minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 ball box - object_
 )
 (:constants
   red_box_1 - box
   empty - empty_0
   room_4 room_1 - room
   grey_ball_1 red_ball_1 - ball
   purple_door_1 grey_door_1 green_door_1 - door
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands) (hold_0) (hold_1) (seen_psi_2) (hold_3) (seen_psi_4) (hold_5))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (when (or (carrying red_box_1) (= ?obj red_box_1)) (seen_psi_2)) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (when (carrying red_box_1) (seen_psi_2)) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (when (carrying red_box_1) (seen_psi_2)) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)) (or (not (or (= ?room2 room_4) (and (agentinroom room_4) (not (= ?room1 room_4))))) (seen_psi_4)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (when (and (objectinroom red_ball_1 room_4) (or (= ?room2 room_1) (and (agentinroom room_1) (not (= ?room1 room_1))))) (hold_0)) (when (carrying red_box_1) (seen_psi_2)) (when (or (= ?room2 room_4) (and (agentinroom room_4) (not (= ?room1 room_4)))) (hold_3)) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (when (and (objectinroom red_ball_1 room_4) (not (and (= ?obj red_ball_1) (= ?room room_4))) (agentinroom room_1)) (hold_0)) (when (or (= ?obj red_box_1) (carrying red_box_1) (and (at_ red_box_1) (not (= ?obj red_box_1)))) (seen_psi_2)) (when (or (= ?obj grey_ball_1) (carrying grey_ball_1) (not (locked green_door_1))) (seen_psi_4)) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (when (and (or (and (= ?obj red_ball_1) (= ?room room_4)) (objectinroom red_ball_1 room_4)) (agentinroom room_1)) (hold_0)) (when (or (and (carrying red_box_1) (not (= ?obj red_box_1))) (= ?obj red_box_1) (at_ red_box_1)) (seen_psi_2)) (when (or (and (carrying grey_ball_1) (not (= ?obj grey_ball_1))) (not (locked green_door_1))) (seen_psi_4)) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door) (or (and (not (locked ?door)) (= ?door purple_door_1)) (and (locked purple_door_1) (not (and (locked ?door) (= ?door purple_door_1)))) (seen_psi_2)))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (when (not (or (and (not (locked ?door)) (= ?door purple_door_1)) (and (locked purple_door_1) (not (and (locked ?door) (= ?door purple_door_1)))))) (hold_1)) (when (or (carrying grey_ball_1) (not (or (and (not (locked ?door)) (= ?door green_door_1)) (and (locked green_door_1) (not (and (locked ?door) (= ?door green_door_1))))))) (seen_psi_4)) (when (not (or (and (not (locked ?door)) (= ?door grey_door_1)) (and (locked grey_door_1) (not (and (locked ?door) (= ?door grey_door_1)))))) (hold_5)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_minigrid-problem)
 (:domain liftedtcore_minigrid-domain)
 (:objects
   room_2 room_3 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   red_door_1 - door
   grey_ball_3 purple_ball_1 grey_ball_2 - ball
   blue_box_1 green_box_1 - box
 )
 (:init (agentinroom room_2) (objectinroom grey_ball_1 room_1) (objectinroom red_ball_1 room_1) (objectinroom blue_box_1 room_2) (objectinroom red_box_1 room_3) (objectinroom green_box_1 room_3) (objectinroom grey_ball_2 room_3) (objectinroom purple_ball_1 room_3) (objectinroom grey_ball_3 room_4) (objectcolor grey_ball_1 greytype) (objectcolor red_ball_1 redtype) (objectcolor blue_box_1 bluetype) (objectcolor red_box_1 redtype) (objectcolor green_box_1 greentype) (objectcolor grey_ball_2 greytype) (objectcolor purple_ball_1 purpletype) (objectcolor grey_ball_3 greytype) (objectcolor red_door_1 redtype) (objectcolor green_door_1 greentype) (objectcolor purple_door_1 purpletype) (objectcolor grey_door_1 greytype) (emptyhands) (locked red_door_1) (locked green_door_1) (locked purple_door_1) (locked grey_door_1) (adjacentrooms room_2 room_1 red_door_1) (adjacentrooms room_1 room_2 red_door_1) (adjacentrooms room_3 room_1 green_door_1) (adjacentrooms room_1 room_3 green_door_1) (adjacentrooms room_4 room_2 purple_door_1) (adjacentrooms room_2 room_4 purple_door_1) (adjacentrooms room_4 room_3 grey_door_1) (adjacentrooms room_3 room_4 grey_door_1) (visited room_2) (= (total-cost) 0))
 (:goal (and (exists (?v - ball)
 (and (objectcolor ?v greytype) (objectinroom ?v room_4) (agentinroom room_4) (at_ ?v))) (hold_0) (hold_1) (hold_3) (hold_5)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor red_door_1 room_2 room_1)
   added: (at_ red_door_1)
   goals met: 0 of 5
2. (toggle red_door_1)
   deleted: (locked red_door_1)
   goals met: 0 of 5
3. (gotoroom room_2 room_1 red_door_1)
   deleted: (agentinroom room_2) (at_ red_door_1)
   added: (agentinroom room_1) (visited room_1)
   goals met: 0 of 5
4. (gotodoor green_door_1 room_1 room_3)
   added: (at_ green_door_1)
   goals met: 0 of 5
5. (toggle green_door_1)
   deleted: (locked green_door_1)
   added: (seen_psi_4)
   goals met: 0 of 5
6. (gotoobject red_ball_1 room_1)
   deleted: (at_ green_door_1)
   added: (at_ red_ball_1)
   goals met: 0 of 5
7. (pick red_ball_1 room_1)
   deleted: (at_ red_ball_1) (emptyhands) (objectinroom red_ball_1 room_1)
   added: (carrying red_ball_1)
   goals met: 0 of 5
8. (gotoroom room_1 room_3 green_door_1)
   deleted: (agentinroom room_1)
   added: (agentinroom room_3) (visited room_3)
   goals met: 0 of 5
9. (gotodoor grey_door_1 room_3 room_4)
   added: (at_ grey_door_1)
   goals met: 0 of 5
10. (toggle grey_door_1)
   deleted: (locked grey_door_1)
   added: (hold_5)
   goals met: 1 of 5
11. (gotoroom room_3 room_4 grey_door_1)
   deleted: (agentinroom room_3) (at_ grey_door_1)
   added: (agentinroom room_4) (visited room_4) (hold_3)
   goals met: 2 of 5
12. (gotoempty)
   added: (at_ empty)
   goals met: 2 of 5
13. (drop red_ball_1 room_4)
   deleted: (carrying red_ball_1) (at_ empty)
   added: (at_ red_ball_1) (emptyhands) (objectinroom red_ball_1 room_4)
   goals met: 2 of 5
14. (gotoroom room_4 room_3 grey_door_1)
   deleted: (agentinroom room_4) (at_ red_ball_1)
   added: (agentinroom room_3)
   goals met: 2 of 5
15. (gotoobject red_box_1 room_3)
   added: (at_ red_box_1) (seen_psi_2)
   goals met: 2 of 5
16. (gotoroom room_3 room_1 green_door_1)
   deleted: (agentinroom room_3) (at_ red_box_1)
   added: (agentinroom room_1) (hold_0)
   goals met: 3 of 5
17. (gotoroom room_1 room_2 red_door_1)
   deleted: (agentinroom room_1)
   added: (agentinroom room_2)
   goals met: 3 of 5
18. (gotodoor purple_door_1 room_2 room_4)
   added: (at_ purple_door_1)
   goals met: 3 of 5
19. (toggle purple_door_1)
   deleted: (locked purple_door_1)
   added: (hold_1)
   goals met: 4 of 5
20. (gotoroom room_2 room_4 purple_door_1)
   deleted: (agentinroom room_2) (at_ purple_door_1)
   added: (agentinroom room_4)
   goals met: 4 of 5
21. (gotoobject grey_ball_3 room_4)
   added: (at_ grey_ball_3)
   goals met: 5 of 5
